{"backend": "tensorflow", "keras_version": "2.0.9", "class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 100, 6, 1], "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "batch_input_shape": [null, 100, 6, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [6, 1], "name": "conv2d_1", "filters": 10, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "batch_input_shape": [null, 100, 6, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [10, 1], "name": "conv2d_2", "filters": 5, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "strides": [1, 1], "data_format": "channels_first", "dilation_rate": [1, 1], "batch_input_shape": [null, 100, 6, 1], "bias_regularizer": null, "trainable": true, "kernel_size": [5, 1], "name": "conv2d_3", "filters": 2, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "activation": "linear", "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "gamma_constraint": null, "beta_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_4"}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"name": "dense_relu1", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "units": 80}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_relu1"}, {"class_name": "Dense", "config": {"name": "dense_relu2", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "units": 40}, "inbound_nodes": [[["dense_relu1", 0, 0, {}]]], "name": "dense_relu2"}, {"class_name": "Dense", "config": {"name": "dense_relu3", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "activation": "relu", "units": 20}, "inbound_nodes": [[["dense_relu2", 0, 0, {}]]], "name": "dense_relu3"}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_in", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "activation": "linear", "units": 1}, "inbound_nodes": [[["dense_relu3", 0, 0, {}]]], "name": "dense_1"}], "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}